#pragma once

namespace tc
{
	/************************************************************************/
	/* 内存流类                                                           */
	/************************************************************************/
	class MemoryStream
	{
	public:
		//************************************
		// Method:    构造函数
		// Parameter: int len:	缓冲区默认大小
		//************************************
		MemoryStream(int len = 4096);

		~MemoryStream();

	protected:
		BYTE* pBuf;				// 缓冲区指针
		int nBufLen;			// 字节流长度
		int nDataStartIndex;	// 数据段开始索引
		int nDataEndIndex;		// 数据段结束索引

	protected:
		//************************************
		// Method:    重新分配缓冲区
		// Parameter: int len:	总长大小
		//************************************
		void ReAssignBuf(int len);

		//************************************
		// Method:    向左平移
		// Parameter: int len:	平移长度
		//************************************
		void LeftPan(int index, int len, int size);

	public:
		//************************************
		// Method:    获取流缓冲区
		//************************************
		BYTE* GetBuf();

		//************************************
		// Method:    获取当前缓冲区总长度
		//************************************
		int GetTotalLen();

		//************************************
		// Method:    获取可读缓冲区长度
		//************************************
		int AvaliableReadLen();

		//************************************
		// Method:    获取可写缓冲区长度
		//************************************
		int AvaliableWriteLen();

		//************************************
		// Method:    从流中复制一段缓冲区
		// Parameter: BYTE buf[]:	缓冲区		
		// Parameter: int len:		缓冲区长度
		//************************************
		bool Copy(BYTE buf[], int len);

		//************************************
		// Method:    从流中读取一段缓冲区
		// Parameter: BYTE buf[]:	缓冲区		
		// Parameter: int len:		缓冲区长度
		//************************************
		bool Read(BYTE buf[], int len);
		
		//************************************
		// Method:    向流中写入一段缓冲区
		// Parameter: BYTE buf[]:	缓冲区		
		// Parameter: int len:		缓冲区长度
		//************************************
		void Write(BYTE buf[], int len);

		//************************************
		// Method:    清空流
		//************************************
		void Clear();
	};
}